
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	мПоток = Новый ПотокВПамяти();
	фТабличныйДокумент.Записать(мПоток);
	мДвоичныеДанные = мПоток.ЗакрытьИПолучитьДвоичныеДанные();
	ПоместитьВоВременноеХранилище(мДвоичныеДанные, фАдресВременногоХранилища);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фАдресВременногоХранилища = Параметры.АдресВременногоХранилища;
	фИмяДокумента = Параметры.ИмяДокумента;
	ЭтаФорма.Заголовок = фИмяДокумента;
	
	мДвоичныеДанныеМакета = ПолучитьИзВременногоХранилища(фАдресВременногоХранилища);
	//мПоток = Новый ПотокВПамяти(мДвоичныеДанныеМакета
	//фТабличныйДокумент.Прочитать(мПоток);
	//Элементы.фТабличныйДокумент.Редактирование = Истина;
	
	мПоток = мДвоичныеДанныеМакета.ОткрытьПотокДляЧтения();
    фТабличныйДокумент.Прочитать(мПоток);
    мПоток.Закрыть();
КонецПроцедуры
