
Функция GETGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Метод = ВРЕГ(Запрос.ПараметрыURL["ИмяМетода"]);
	
	СтруктураПараметровИзСтрокиАдреса = Новый Структура;
	Для каждого Элемент из Запрос.ПараметрыЗапроса Цикл
		СтруктураПараметровИзСтрокиАдреса.Вставить(Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
	
	Если Метод = "SYNCMA" Тогда
		Результат = Рсш_Поток_Общий.ДанныеДляМобильногоПриложенияКТС();
	ИначеЕсли Метод = "GETBSMTSDATA" Тогда
		Результат = Рсш_Поток_Общий.ПолучитьДанныеБСМТС(Запрос.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
	ИначеЕсли Метод = "GETCOMMENTSMA" Тогда
		Результат = Рсш_Поток_Общий.ПолучитьКомментарии(Запрос.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
	ИначеЕсли Метод = "LOADDOC" Тогда
		Результат = Рсш_Поток_Общий.ЗагрузитьДокумент(Запрос.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
	ИначеЕсли Метод = "TRKRTO" Тогда
		Результат = Рсш_Поток_Общий.СформироватьКРТРТО(Запрос.ПолучитьТелоКакСтроку());
	ИначеЕсли Метод = "WORKSTAT" Тогда
		Результат = Рсш_Поток_Общий.СформироватьСтатистикуПоТС(Запрос.ПолучитьТелоКакСтроку());
	ИначеЕсли Метод = "GETREPAIRSDATA" Тогда
		Результат = Рсш_Поток_Общий.ДанныеПоРемонтамТекст(СтруктураПараметровИзСтрокиАдреса);
		Ответ.Заголовки.Вставить("Content-Type","text/plain; charset=utf-8");
	ИначеЕсли Метод = "GETPROZR" Тогда
		Результат = Рсш_Поток_Общий.ПолучитьТЗСкановДоковТС();
	ИначеЕсли Метод = "TEST" Тогда
		Результат = СтрокаСоединенияИнформационнойБазы();
	ИначеЕсли МЕтод = "PPK" Тогда
		Результат = Рсш_Поток_Общий.ПолучитьДанныеВыполнениеПП(Запрос.ПолучитьТелоКакСтроку(), СтруктураПараметровИзСтрокиАдреса);
		Ответ.Заголовки.Вставить("Content-Type","application/json");
	ИначеЕсли МЕтод = "DATAPROZR" Тогда
		Результат = Рсш_Поток_Общий.ДанныеПрозрачность();
	ИначеЕсли Метод = "GETTSDOCS" Тогда
		Результат = Рсш_Поток_Общий.ПолучитьДокументыТС(Запрос.ПолучитьТелоКакСтроку());
	ИначеЕсли Метод = "GETACTTSDOCS" Тогда
		Результат = Рсш_Поток_Общий.ПолучитьАктуальныеДокументыТС(Запрос.ПолучитьТелоКакСтроку());
	ИначеЕсли Метод = "ITEMSTSGETPHOTO" Тогда
		Результат = Рсш_Поток_Общий.РеквизитыТС(Запрос.ПолучитьТелоКакСтроку(), СтруктураПараметровИзСтрокиАдреса);
	ИначеЕсли Метод = "GETTRANSPDATATABLE" Тогда
		Результат = Рсш_Поток_Общий.ТаблицаЗапросовПрозрачность();
	ИначеЕсли Метод = "GETINSPECTIONLOG" Тогда
		Результат = Рсш_Поток_Общий.СформироватьЖурналОсмотров(Запрос.ПолучитьТелоКакСтроку());
	ИначеЕсли Метод = "SIGNMXL" Тогда
		Результат = Рсш_Поток_Общий.ПодписатьТабличныйДокумент(Запрос.ПолучитьТелоКакСтроку());
	ИначеЕсли Метод = "GETSYNCDATA" Тогда
		Результат = Рсш_Поток_Общий.ПолучитьДанныеДляСинхронизации(Запрос.ПолучитьТелоКакСтроку());
	ИначеЕсли Метод = "GETTSINFO" Тогда
		Результат = Рсш_Поток_Общий.ПолучитьРеквизитыТС(Запрос.ПолучитьТелоКакСтроку())
	ИначеЕсли Метод = "FUNCTIONRESULT" Тогда
		Результат = Рсш_Поток_Общий.ВыполнитьФункцию(Запрос.ПолучитьТелоКакСтроку());
	ИначеЕсли Метод = "TYPESPROZR" Тогда
		Результат = Рсш_Поток_Общий.ТипыПрозрачность();
	Иначе
		Ответ.КодСостояния = 304;
		Результат = "Метод " + Метод + " не обнаружен";
		//Ответ.Заголовки.Вставить("Content-Type","application/json; charset=UTF-8"); // "text/html; charset=UTF-8"
		//Ответ.УстановитьТелоИзСтроки(Результат,"UTF-8");
		//Возврат Ответ;
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(Результат);
	
	Возврат Ответ;
КонецФункции